Autodesk.Revit.DB.ReferenceArrayArray
An array that contains ReferenceArray objects.

Autodesk.Revit.DB.ReferenceArrayArray.Insert(Autodesk.Revit.Element,System.Int32)
System.Int32
Insert the specified ReferenceArray into the array.
item: The ReferenceArray to be inserted into the array.
index: The ReferenceArray will be inserted before this index.
Returns: Returns whether the ReferenceArray was inserted into the array.

Autodesk.Revit.DB.ReferenceArrayArray.GetEnumerator
System.Collections.IEnumerator
Retrieve a forward moving iterator to the array.
Returns: Returns a forward moving iterator to the array.

Autodesk.Revit.DB.ReferenceArrayArray.ReverseIterator
Autodesk.Revit.DB.ReferenceArrayArrayIterator
Retrieve a backward moving iterator to the array.
Returns: Returns a backward moving iterator to the array.

Autodesk.Revit.DB.ReferenceArrayArray.ForwardIterator
Autodesk.Revit.DB.ReferenceArrayArrayIterator
Retrieve a forward moving iterator to the array.
Returns: Returns a forward moving iterator to the array.

Autodesk.Revit.DB.ReferenceArrayArray.Append(Autodesk.Revit.Element)
void
Add the ReferenceArray to the end of the array.
item: The ReferenceArray to be added.

Autodesk.Revit.DB.ReferenceArrayArray.Clear
void
Removes every ReferenceArray from the array, rendering it empty.

Autodesk.Revit.DB.ReferenceArrayArray.Size
System.Int32
get
Returns the number of ReferenceArrays that are in the array.

Autodesk.Revit.DB.ReferenceArrayArray.Item(System.Int32)
Autodesk.Revit.Element
Gets or sets a ReferenceArray at a specified index within the array.
index: The index of the ReferenceArray to be set or retrieved.
Returns: Returns the ReferenceArray at the specified index.

Autodesk.Revit.DB.ReferenceArrayArray.IsEmpty
System.Boolean
get
Test to see if the array is empty.
Remarks: If the array is empty then True will be returned, otherwise False.